package interesse;

public class ВыводЧиселСловПредложенийНаMonitor {
    // Напишите программу, которая выводит на экран числа от 1 до 10.
    // Самый простой вариант решения этой Java-задачи — использовать цикл for:

    public class NumbersFromOneToTen {
        public static void main(String[] args) {
            for (int i = 1; i <= 10; i++) {
                System.out.print(i + " ");
            }
        }
    }
}
